feaser/openblt/Target/Source/ARMCM4_STM32/flash.c
/****************************************************************************************
|  Description: bootloader flash driver source file
|    File Name: flash.c
|
|----------------------------------------------------------------------------------------
|                          C O P Y R I G H T
|----------------------------------------------------------------------------------------
|   Copyright (c) 2013  by Feaser    http://www.feaser.com    All rights reserved
|
|----------------------------------------------------------------------------------------
|                            L I C E N S E
|----------------------------------------------------------------------------------------
| This file is part of OpenBLT. OpenBLT is free software: you can redistribute it and/or
| modify it under the terms of the GNU General Public License as published by the Free
| Software Foundation, either version 3 of the License, or (at your option) any later
| version.
|
| OpenBLT is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY;
| without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR
| PURPOSE. See the GNU General Public License for more details.
|
| You should have received a copy of the GNU General Public License along with OpenBLT.
| If not, see <http://www.gnu.org/licenses/>.
|
| A special exception to the GPL is included to allow you to distribute a combined work 
| that includes OpenBLT without being obliged to provide the source code for any 
| proprietary components. The exception text is included at the bottom of the license
| file <license.html>.
| 
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "boot.h"                                /* bootloader generic header          */
#include "stm32f4xx.h"                           /* STM32 registers                    */
#include "stm32f4xx_conf.h"                      /* STM32 peripheral drivers           */


/****************************************************************************************
* Macro definitions
****************************************************************************************/
#define FLASH_INVALID_SECTOR            (0xff)
#define FLASH_INVALID_ADDRESS           (0xffffffff)
#define FLASH_WRITE_BLOCK_SIZE          (512)
#define FLASH_TOTAL_SECTORS             (sizeof(flashLayout)/sizeof(flashLayout[0]))
#define FLASH_VECTOR_TABLE_CS_OFFSET    (0x188)


/****************************************************************************************
* Type definitions
****************************************************************************************/
/* flash sector descriptor type */
typedef struct 
{
  blt_addr   sector_start;                       /* sector start address               */
  blt_int32u sector_size;                        /* sector size in bytes               */
  blt_int8u  sector_num;                         /* sector number                      */
} tFlashSector;                                  /* flash sector description           */

/* programming is done per block of max FLASH_WRITE_BLOCK_SIZE. for this a flash block
 * manager is implemented in this driver. this flash block manager depends on this
 * flash block info structure. It holds the base address of the flash block and the
 * data that should be programmed into the flash block. The .base_addr must be a multiple 
 * of FLASH_WRITE_BLOCK_SIZE.
 */
typedef struct
{
  blt_addr  base_addr;
  blt_int8u data[FLASH_WRITE_BLOCK_SIZE];
} tFlashBlockInfo;


/****************************************************************************************
* Function prototypes
****************************************************************************************/
static blt_bool  FlashInitBlock(tFlashBlockInfo *block, blt_addr address);
static tFlashBlockInfo *FlashSwitchBlock(tFlashBlockInfo *block, blt_addr base_addr);
static blt_bool  FlashAddToBlock(tFlashBlockInfo *block, blt_addr address, 
                                 blt_int8u *data, blt_int16u len);
static blt_bool  FlashWriteBlock(tFlashBlockInfo *block);
static blt_bool  FlashEraseSectors(blt_int8u first_sector, blt_int8u last_sector);
static blt_int8u FlashGetSector(blt_addr address);


/****************************************************************************************
* Local constant declarations
****************************************************************************************/
/* layout of the physical flash memory */
static const tFlashSector flashLayout[] =
{
#if (BOOT_FILE_SYS_ENABLE > 0)
  /* the size of the bootloader with support for firmware update from a locally attached
   * storage disk is larger so the start address of the user program is at a different 
   * location.
   */
  /* { 0x08000000, 0x04000,  0},           flash sector  0 - reserved for bootloader   */
  /* { 0x08004000, 0x04000,  1},           flash sector  1 - reserved for bootloader   */
#else
  /* { 0x08000000, 0x04000,  0},           flash sector  0 - reserved for bootloader   */
  { 0x08004000, 0x04000,  1},           /* flash sector  1 -  16kb                     */
#endif
  { 0x08008000, 0x04000,  2},           /* flash sector  2 -  16kb                     */
  { 0x0800c000, 0x04000,  3},           /* flash sector  3 -  16kb                     */
  { 0x08010000, 0x10000,  4},           /* flash sector  4 -  64kb                     */
  { 0x08020000, 0x20000,  5},           /* flash sector  5 - 128kb                     */
  { 0x08040000, 0x20000,  6},           /* flash sector  6 - 128kb                     */
  { 0x08060000, 0x20000,  7},           /* flash sector  7 - 128kb                     */
#if (BOOT_NVM_SIZE_KB > 512)
  { 0x08080000, 0x20000,  8},           /* flash sector  8 - 128kb                     */
  { 0x080A0000, 0x20000,  9},           /* flash sector  9 - 128kb                     */
  { 0x080C0000, 0x20000, 10},           /* flash sector 10 - 128kb                     */
  { 0x080E0000, 0x20000, 11},           /* flash sector 11 - 128kb                     */
#endif
#if (BOOT_NVM_SIZE_KB > 1024)
  { 0x08100000, 0x04000, 12},           /* flash sector 12 -  16kb                     */
  { 0x08104000, 0x04000, 13},           /* flash sector 13 -  16kb                     */
  { 0x08108000, 0x04000, 14},           /* flash sector 14 -  16kb                     */
  { 0x0810c000, 0x04000, 15},           /* flash sector 15 -  16kb                     */
  { 0x08110000, 0x10000, 16},           /* flash sector 16 -  64kb                     */
  { 0x08120000, 0x20000, 17},           /* flash sector 17 - 128kb                     */
  { 0x08140000, 0x20000, 18},           /* flash sector 18 - 128kb                     */
  { 0x08160000, 0x20000, 19},           /* flash sector 19 - 128kb                     */
  { 0x08180000, 0x20000, 20},           /* flash sector 20 - 128kb                     */
  { 0x081A0000, 0x20000, 21},           /* flash sector 21 - 128kb                     */
  { 0x081C0000, 0x20000, 22},           /* flash sector 22 - 128kb                     */
  { 0x081E0000, 0x20000, 23},           /* flash sector 23 - 128kb                     */
#endif
#if (BOOT_NVM_SIZE_KB > 2048)
#error "BOOT_NVM_SIZE_KB > 2048 is currently not supported."
#endif
};

/* the STM32F4x Standard Peripheral Library driver needs a sector mask instead of the
 * sector number. this ROM lookup table can quickly convert the sector number to its
 * mask.
 */
static const blt_int16u flashSectorNumToMask[] =
{
  FLASH_Sector_0,                        /* idx 0  - mask for sector 0                 */
  FLASH_Sector_1,                        /* idx 1  - mask for sector 1                 */
  FLASH_Sector_2,                        /* idx 2  - mask for sector 2                 */
  FLASH_Sector_3,                        /* idx 3  - mask for sector 3                 */
  FLASH_Sector_4,                        /* idx 4  - mask for sector 4                 */
  FLASH_Sector_5,                        /* idx 5  - mask for sector 5                 */
  FLASH_Sector_6,                        /* idx 6  - mask for sector 6                 */
  FLASH_Sector_7,                        /* idx 7  - mask for sector 7                 */
  FLASH_Sector_8,                        /* idx 8  - mask for sector 8                 */
  FLASH_Sector_9,                        /* idx 9  - mask for sector 9                 */
  FLASH_Sector_10,                       /* idx 10 - mask for sector 10                */
  FLASH_Sector_11,                       /* idx 11 - mask for sector 11                */
  FLASH_Sector_12,                       /* idx 12 - mask for sector 12                */
  FLASH_Sector_13,                       /* idx 13 - mask for sector 13                */
  FLASH_Sector_14,                       /* idx 14 - mask for sector 14                */
  FLASH_Sector_15,                       /* idx 15 - mask for sector 15                */
  FLASH_Sector_16,                       /* idx 16 - mask for sector 16                */
  FLASH_Sector_17,                       /* idx 17 - mask for sector 17                */
  FLASH_Sector_18,                       /* idx 18 - mask for sector 18                */
  FLASH_Sector_19,                       /* idx 19 - mask for sector 19                */
  FLASH_Sector_20,                       /* idx 20 - mask for sector 20                */
  FLASH_Sector_21,                       /* idx 21 - mask for sector 21                */
  FLASH_Sector_22,                       /* idx 22 - mask for sector 22                */
  FLASH_Sector_23                        /* idx 23 - mask for sector 23                */
};


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/* The smallest amount of flash that can be programmed is FLASH_WRITE_BLOCK_SIZE. A flash
 * block manager is implemented in this driver and stores info in this variable. Whenever
 * new data should be flashed, it is first added to a RAM buffer, which is part of this
 * variable. Whenever the RAM buffer, which has the size of a flash block, is full or 
 * data needs to be written to a different block, the contents of the RAM buffer are 
 * programmed to flash. The flash block manager requires some software overhead, yet
 * results is faster flash programming because data is first harvested, ideally until
 * there is enough to program an entire flash block, before the flash device is actually
 * operated on.
 */
static tFlashBlockInfo blockInfo;

/* The first block of the user program holds the vector table, which on the STM32 is
 * also the where the checksum is written to. Is it likely that the vector table is
 * first flashed and then, at the end of the programming sequence, the checksum. This
 * means that this flash block need to be written to twice. Normally this is not a 
 * problem with flash memory, as long as you write the same values to those bytes that
 * are not supposed to be changed and the locations where you do write to are still in
 * the erased 0xFF state. Unfortunately, writing twice to flash this way, does not work
 * reliably on all micros. This is why we need to have an extra block, the bootblock,
 * placed under the management of the block manager. This way is it possible to implement
 * functionality so that the bootblock is only written to once at the end of the 
 * programming sequency.
 */
static tFlashBlockInfo bootBlockInfo;


/****************************************************************************************
** NAME:           FlashInit
** PARAMETER:      none
** RETURN VALUE:   none
** DESCRIPTION:    Initializes the flash driver. 
**
****************************************************************************************/
void FlashInit(void)
{
  /* init the flash block info structs by setting the address to an invalid address */
  blockInfo.base_addr = FLASH_INVALID_ADDRESS;
  bootBlockInfo.base_addr = FLASH_INVALID_ADDRESS;
} /*** end of FlashInit ***/


/****************************************************************************************
** NAME:           FlashWrite
** PARAMETER:      addr start address
**                 len  length in bytes
**                 data pointer to the data buffer.
** RETURN VALUE:   BLT_TRUE if successful, BLT_FALSE otherwise. 
** DESCRIPTION:    Writes the data to flash through a flash block manager. Note that this
**                 function also checks that no data is programmed outside the flash 
**                 memory region, so the bootloader can never be overwritten.
**
****************************************************************************************/
blt_bool FlashWrite(blt_addr addr, blt_int32u len, blt_int8u *data)
{
  blt_addr base_addr;

